app/views/index/_channels.html.erb

			<% begin %>
				<% youtubeinfoid=YoutubeInfoId.find(f.youtube_info_id.to_i) %>
---
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."id" = ? LIMIT 1  [["id", 8]]

				<% youtubeinfoid=f %>
				<% f=User.find(f.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]

					<% catArray.each do |f| %>
						<% category=Category.find(f.gsub("id", "").to_i) %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]