app/views/index/_listCategory.html.erb

	<h3>Категории</h3>
	<% categories=Category.all.sort_by!{ |m| m.name.downcase } %>
---
SELECT "categories".* FROM "categories"