app/views/index/_offers.html.erb

SELECT COUNT(*) FROM "offermessages" WHERE "offermessages"."offer_id" = 4
---
					<% if params[:action]=="offers" || me %>
						<a href="/offers/applicants/<%= f.id %>"><%= Offermessage.where(:offer_id=>f.id).count %></a>