app/views/index/_registrationForm.html.erb

SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."id" = ? LIMIT 1  [["id", 11]]
---
<% youtubeinfoid=YoutubeInfoId.find(session[:youtube_info_id]) %>

SELECT "categories".* FROM "categories"
---
					   <div class="category_section">
					    <% if @user.category && @user.category.include?(",") %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
					      <% id=f.gsub("id", "") %>
					      <% category=Category.find(id.to_i) %>