app/views/index/_userinfo.html.erb

<% youtubeinfo=YoutubeInfoId.find_by_user_id(@user.id) %>
---
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."user_id" = 11 LIMIT 1