app/views/index/applicants.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."id" = ? LIMIT 1  [["id", 11]]
---
		<tr>
			<% @user=User.find(f.user_id) %>
			<% youtubeinfoid=YoutubeInfoId.find(@user.youtube_info_id) %>