app/views/index/directmessages.html.erb

SELECT "topics".* FROM "topics" WHERE ((to_topic = 11 or from_topic = 11))
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."user_id" = 11 LIMIT 1
---
		<tr>
			<% user=User.find(f.from_topic) %>
			<% youtubeinfoid=YoutubeInfoId.find_by_user_id(user.id) %>