app/views/index/profile.html.erb

	<div class="info-center">
		<% youtubeinfooid=YoutubeInfoId.find_by_user_id(@user.id) %>
---
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."user_id" = 11 LIMIT 1

		<div>
			<% categoryIds=user.category.split(",").map{|f| f=f.gsub("id", "").to_i} %>
			<% Category.find(categoryIds).each do |f| %>
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]

						<%= f.label :best, "С наилучшими пожеланиями, " %>
						<%= f.text_field :best, :value=>"#{YoutubeInfoId.find(session[:youtube_info_id]).name}" %>
---
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."id" = ? LIMIT 1  [["id", 10]]