app/views/index/registration.html.erb

SELECT "categories".* FROM "categories"
---
    	<select>
    		<% Category.all.each do |f| %>