app/controllers/index_controller.rb

SELECT "users".* FROM "users" WHERE "users"."youtube_info_id" = 11 LIMIT 1
---
  def registration
  	unless session[:youtube_info_id]
  		redirect_to root_url
  	else
      @url="/index/create"
  		@user=User.new
      redirect_to root_url if User.find_by_youtube_info_id(session[:youtube_info_id])

SELECT "users".* FROM "users" WHERE "users"."youtube_info_id" = 1 LIMIT 1
INSERT INTO "users" ("anketa_id", "category", "city", "created_at", "email", "phone", "updated_at", "youtube_info_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "youtube_info_ids" SET "create_videos" = 't', "making_channel_toghether" = 't', "cross_promotions_and_email_lists" = 't', "recommended_channel_swapping" = 't', "annotation_or_end_card_or_link_swapping" = 't', "open_to_other_types" = 't', "brand_product_integration" = 't', "product_reviews" = 't', "dedicated_videos" = 't', "revenue_affiliate" = 't', "spokesperson" = 't', "offyoutube_promotion" = 't', "including_brand_videos" = 't', "user_id" = 11, "updated_at" = '2015-09-17 18:10:03.944079' WHERE "youtube_info_ids"."id" = 10
SELECT "youtube_info_ids".* FROM "youtube_info_ids" WHERE "youtube_info_ids"."id" = ? LIMIT 1  [["id", 9]]
---
  def create
    user=User.find_by_youtube_info_id(session[:youtube_info_id])
    error_validate=nil
    begin
    	if session[:youtube_info_id] and !user
        params[:user][:youtube_info_id]=session[:youtube_info_id]
        user=User.create(params[:user])
        if user.valid?
          user.save
          params[:anketa][:user_id]=user.id
          YoutubeInfoId.find(session[:youtube_info_id]).update_attributes(params[:anketa])

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
  def search
  	@users=User.order("created_at DESC")

SELECT "youtube_info_ids".* FROM "youtube_info_ids" LIMIT 1
---
  def searchingCheckbox
  	youtubeinfoid=YoutubeInfoId.search(params[:search])

SELECT "users".* FROM "users" WHERE ("users"."category" LIKE '%id1,%') ORDER BY created_at DESC
---
  def category
  	search=User.order("created_at DESC").search(:category_cont=>"id"+params[:id]+",")

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
---
  def profile
  	if session[:user_id]
  		@user=User.find(params[:id])

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", 11]]
---
  def offers
  	@offers=Offer.where(:user_id=>session[:user_id])

INSERT INTO "offers" ("application_deadline", "created_at", "description", "location_dependent", "location_dependent_boolean", "name", "project_type", "subscriber_range", "targe_audience_geos", "target_channel_categories", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def createofferpost
  	params[:offer][:user_id]=session[:user_id]
  	offer=Offer.create(params[:offer])

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "2"]]
---
  def editoffer
  	@offer=Offer.find(params[:id])

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "offers" SET "project_type" = 'КУЙ ТВ', "updated_at" = '2015-09-18 19:39:11.996204' WHERE "offers"."id" = 2
---
  def updateoffer
  	@offer=Offer.find(params[:id])
    @offer.assign_attributes(params[:offer])
    error_validate=false
  	if @offer.user_id==session[:user_id]
      if @offer.valid?
  		  @offer.save

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 2]]
---
  def destroyoffer
  	@offer=Offer.find(params[:id])
  	if @offer.user_id==session[:user_id]
  		@offer.destroy

SELECT "offers".* FROM "offers" WHERE (user_id != 11) ORDER BY created_at DESC
---
  def collabration
    @offers=Offer.order("created_at DESC").where("user_id != ?", session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
---
  def account
    @user=User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "users" SET "category" = 'id2,', "updated_at" = '2015-09-19 15:10:32.562508' WHERE "users"."id" = 11
UPDATE "youtube_info_ids" SET "brand_product_integration" = 'f', "product_reviews" = 'f', "dedicated_videos" = 'f', "revenue_affiliate" = 'f', "spokesperson" = 'f', "updated_at" = '2015-09-19 13:01:23.280274' WHERE "youtube_info_ids"."id" = 10
---
  def update_account
    @user=User.find(session[:user_id])
    error_validate=nil
    if session[:youtube_info_id] and session[:user_id]
      params[:user][:youtube_info_id]=session[:youtube_info_id]
      @user.assign_attributes(params[:user])
      if @user.valid?
        @user.save
        params[:anketa][:user_id]=@user.id
        YoutubeInfoId.find(session[:youtube_info_id]).update_attributes(params[:anketa])

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "3"]]
---
  def offerdetails
    @offer=Offer.find(params[:id])

INSERT INTO "offermessages" ("created_at", "offer_id", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 19 Sep 2015 20:57:03 UTC +00:00], ["offer_id", nil], ["text", nil], ["updated_at", Sat, 19 Sep 2015 20:57:03 UTC +00:00], ["user_id", 13]]
---
  def offerapplycreate
    hash={:user_id=>session[:user_id], :offer_id=>params[:id]}
    if Offermessage.where(hash).count<1
      Offermessage.create(hash).save

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "offermessages".* FROM "offermessages" WHERE "offermessages"."offer_id" = 3
---
  def applicants
    offer=Offer.find(params[:id])
    if offer.user_id==session[:user_id]
      @offermessages=Offermessage.where(:offer_id=>params[:id])

INSERT INTO "topics" ("best", "created_at", "date_happing", "description", "from_topic", "happing_to", "name", "project_type", "to_topic", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def createtopic
    params[:topic][:to_topic]=params[:id]
    params[:topic][:from_topic]=session[:user_id]
    topic=Topic.create(params[:topic])

SELECT "topics".* FROM "topics" WHERE ((to_topic = 11 or from_topic = 11))
---
  def directmessages
    @topics=Topic.where("(to_topic = ? or from_topic = ?)", session[:user_id], session[:user_id])

SELECT "topics".* FROM "topics" WHERE (id = '1' and (to_topic = 11 or from_topic = 11)) LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."topic_id" = 1 ORDER BY created_at DESC LIMIT 30
---
  def topic
    @topic=Topic.where("id = ? and (to_topic = ? or from_topic = ?)", params[:id], session[:user_id], session[:user_id]).first
    if @topic
      @messages=Message.order("created_at DESC").limit(30).find_all_by_topic_id(@topic.id)

SELECT "topics".* FROM "topics" WHERE (id = '11' and (to_topic = 11 or from_topic = 11)) LIMIT 1
INSERT INTO "messages" ("created_at", "from_message", "text", "to_message", "topic_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 21 Sep 2015 18:13:41 UTC +00:00], ["from_message", 11], ["text", "аыфыафыафыа"], ["to_message", 11], ["topic_id", 1], ["updated_at", Mon, 21 Sep 2015 18:13:41 UTC +00:00]]
---
  def createmessage
    topic=Topic.where("id = ? and (to_topic = ? or from_topic = ?)", params[:message][:topic_id], params[:id], params[:id]).first
    if topic
      params[:message][:to_message]=params[:id]
      params[:message][:from_message]=session[:user_id]
      @message=Message.create(params[:message])

SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'ghetto-workout-ru@yandex.ru' LIMIT 1
---
  def checkAdmin
  	admin=Admin.find_by_email(params[:email])