app/controllers/index_controller.rb

SELECT "users".* FROM "users" WHERE "users"."youtube_info_id" = 1 LIMIT 1
---
  def start
    objectYoutube=YoutubeInfoId.new
    youtube_info_id=objectYoutube.startYoutubeApi
    session[:youtube_info_id]=youtube_info_id.id

    if @user=User.find_by_youtube_info_id(youtube_info_id.id)