app/controllers/textdescs_controller.rb

  def index
    @textdescs = Textdesc.all
---
SELECT "textdescs".* FROM "textdescs"

  def show
    @textdesc = Textdesc.find(params[:id])
---
SELECT "textdescs".* FROM "textdescs" WHERE "textdescs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @textdesc = Textdesc.new(params[:textdesc])

    respond_to do |format|
      if @textdesc.save
---
INSERT INTO "textdescs" ("created_at", "name", "text", "updated_at") VALUES (?, ?, ?, ?)